stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_system.h
/** @defgroup SYSTEM_LL_EC_LATENCY FLASH LATENCY
  * @{
  */
#define LL_FLASH_LATENCY_0                 0x00000000U                  /*!< FLASH Zero wait state  */
#define LL_FLASH_LATENCY_1                 FLASH_CONFIG_WAIT_STATES_0   /*!< FLASH One wait state when system clock frequency is 64 MHz */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_IO_DTR EXTI Lines
  * @{
  */
#define LL_EXTI_LINE_PA0                        SYSCFG_IO_DTR_PA0_DT     /*!< PA0  */
#define LL_EXTI_LINE_PA1                        SYSCFG_IO_DTR_PA1_DT     /*!< PA1  */
#define LL_EXTI_LINE_PA2                        SYSCFG_IO_DTR_PA2_DT     /*!< PA2  */
#define LL_EXTI_LINE_PA3                        SYSCFG_IO_DTR_PA3_DT     /*!< PA3  */
#if defined (STM32WB06) || defined (STM32WB07)
#define LL_EXTI_LINE_PA4                        SYSCFG_IO_DTR_PA4_DT     /*!< PA4  */
#define LL_EXTI_LINE_PA5                        SYSCFG_IO_DTR_PA5_DT     /*!< PA5  */
#define LL_EXTI_LINE_PA6                        SYSCFG_IO_DTR_PA6_DT     /*!< PA6  */
#define LL_EXTI_LINE_PA7                        SYSCFG_IO_DTR_PA7_DT     /*!< PA7  */
#endif
#define LL_EXTI_LINE_PA8                        SYSCFG_IO_DTR_PA8_DT     /*!< PA8  */
#define LL_EXTI_LINE_PA9                        SYSCFG_IO_DTR_PA9_DT     /*!< PA9  */
#define LL_EXTI_LINE_PA10                       SYSCFG_IO_DTR_PA10_DT    /*!< PA10 */
#define LL_EXTI_LINE_PA11                       SYSCFG_IO_DTR_PA11_DT    /*!< PA11 */
#if defined (STM32WB06) || defined (STM32WB07)
#define LL_EXTI_LINE_PA12                       SYSCFG_IO_DTR_PA12_DT    /*!< PA12 */
#define LL_EXTI_LINE_PA13                       SYSCFG_IO_DTR_PA13_DT    /*!< PA13 */
#define LL_EXTI_LINE_PA14                       SYSCFG_IO_DTR_PA14_DT    /*!< PA14 */
#define LL_EXTI_LINE_PA15                       SYSCFG_IO_DTR_PA15_DT    /*!< PA15 */
#endif
#define LL_EXTI_LINE_PB0                        SYSCFG_IO_DTR_PB0_DT     /*!< PB0  */
#define LL_EXTI_LINE_PB1                        SYSCFG_IO_DTR_PB1_DT     /*!< PB1  */
#define LL_EXTI_LINE_PB2                        SYSCFG_IO_DTR_PB2_DT     /*!< PB2  */
#define LL_EXTI_LINE_PB3                        SYSCFG_IO_DTR_PB3_DT     /*!< PB3  */
#define LL_EXTI_LINE_PB4                        SYSCFG_IO_DTR_PB4_DT     /*!< PB4  */
#define LL_EXTI_LINE_PB5                        SYSCFG_IO_DTR_PB5_DT     /*!< PB5  */
#define LL_EXTI_LINE_PB6                        SYSCFG_IO_DTR_PB6_DT     /*!< PB6  */
#define LL_EXTI_LINE_PB7                        SYSCFG_IO_DTR_PB7_DT     /*!< PB7  */
#if defined (STM32WB06) || defined (STM32WB07)
#define LL_EXTI_LINE_PB8                        SYSCFG_IO_DTR_PB8_DT     /*!< PB8  */
#define LL_EXTI_LINE_PB9                        SYSCFG_IO_DTR_PB9_DT     /*!< PB9  */
#define LL_EXTI_LINE_PB10                       SYSCFG_IO_DTR_PB10_DT    /*!< PB10 */
#define LL_EXTI_LINE_PB11                       SYSCFG_IO_DTR_PB11_DT    /*!< PB11 */
#endif
#define LL_EXTI_LINE_PB12                       SYSCFG_IO_DTR_PB12_DT    /*!< PB12 */
#define LL_EXTI_LINE_PB13                       SYSCFG_IO_DTR_PB13_DT    /*!< PB13 */
#define LL_EXTI_LINE_PB14                       SYSCFG_IO_DTR_PB14_DT    /*!< PB14 */
#define LL_EXTI_LINE_PB15                       SYSCFG_IO_DTR_PB15_DT    /*!< PB15 */
#define LL_EXTI_LINE_ALL                       (0xFFFFFFFFU)             /*!< All the PA0...PB15 */

#if defined(USE_FULL_LL_DRIVER)
#define LL_EXTI_LINE_NONE                      (0x00000000U)    /*!<   */
#endif /*USE_FULL_LL_DRIVER*/

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TYPE EXTI Type
  * @{
  */
#define LL_EXTI_TYPE_EDGE               ((uint8_t)0x00U) /*!<  Interrupt Type EDGE detection */
#define LL_EXTI_TYPE_LEVEL              ((uint8_t)0x01U) /*!<  Interrupt Type LEVEL detection */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TRIGGER  EXTI Edge Trigger
  * @{
  */
#define LL_EXTI_TRIGGER_NONE                 ((uint8_t)0x00U) /*!< Trigger None */
#define LL_EXTI_TRIGGER_RISING_EDGE          ((uint8_t)0x01U) /*!< Trigger Rising Edge */
#define LL_EXTI_TRIGGER_FALLING_EDGE         ((uint8_t)0x02U) /*!< Trigger Falling Edge */
#define LL_EXTI_TRIGGER_BOTH_EDGE            ((uint8_t)0x03U) /*!< Trigger Both Edge */
#define LL_EXTI_TRIGGER_LOW_LEVEL            ((uint8_t)0x04U) /*!< Trigger Low Level */
#define LL_EXTI_TRIGGER_HIGH_LEVEL           ((uint8_t)0x05U) /*!< Trigger High Level */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_DEVICE_INFORMATION Device Version Information
  * @{
  */
#define LL_BLUENRG_LP_CUT_10               0x10
#define LL_BLUENRG_LP_CUT_20               0x20

/**
  * @}
  */
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup SYSCFG_IO_LL_Exported_Macros SYSCFG Exported Macros
  * @{
  */

/** @defgroup EXTI_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in SYSCFG register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_SYSCFG_WriteReg(__REG__, __VALUE__) WRITE_REG(SYSCFG->__REG__, (__VALUE__))

/**
  * @brief  Read a value in SYSCFG register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_SYSCFG_ReadReg(__REG__) READ_REG(SYSCFG->__REG__)
/**
  * @}
  */


/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Functions SYSTEM Exported Functions
  * @{
  */
/** @defgroup SYSCFG_LL_EC SYSCFG exported Functions
  * @{
  */

/**
  * @brief  Get the device version and cut information.
  * @rmtoll DIE_ID PRODUCT/VERSION/REVISION   LL_SYSCFG_GetDeviceID
  * @retval Device ID
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDeviceID(void)
{
  return (uint32_t)READ_REG(SYSCFG->DIE_ID);
}


/**
  * @brief  Get the device cut revision (metal fix) information.
  * @rmtoll DIE_ID REVISION   LL_SYSCFG_GetDeviceRevision
  * @retval Device ID
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDeviceRevision(void)
{
  return (uint32_t)((READ_REG(SYSCFG->DIE_ID) & SYSCFG_DIE_ID_REVISION) >> SYSCFG_DIE_ID_REVISION_Pos);
}

/**
  * @brief  Get the device cut version information.
  * @rmtoll DIE_ID VERSION   LL_SYSCFG_GetDeviceVersion
  * @retval Device ID
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDeviceVersion(void)
{
  return (uint32_t)((READ_REG(SYSCFG->DIE_ID) & SYSCFG_DIE_ID_VERSION) >> SYSCFG_DIE_ID_VERSION_Pos);
}

/**
  * @brief  Get the JTAG_ID device information.
  * @rmtoll JTAG_ID    LL_SYSCFG_GetDeviceJTAG_ID
  * @retval Device ID
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDeviceJTAG_ID(void)
{
  return (uint32_t)READ_REG(SYSCFG->JTAG_ID);
}

/**
  * @brief  Set memory mapping at address 0x00000000
  * @rmtoll CONFIG REMAP      LL_SYSCFG_SetRemapMemory
  * @param  Memory This parameter can be one of the following values:
  * @arg LL_SYSCFG_REMAP_FLASH
  * @arg LL_SYSCFG_REMAP_SRAM
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetRemapMemory(uint32_t Memory)
{
  MODIFY_REG(FLASH->CONFIG, (FLASH_CONFIG_REMAP), Memory);
}

/**
  * @brief  Get memory mapping at address 0x00000000
  * @rmtoll CONFIG REMAP      LL_SYSCFG_GetRemapMemory
  * @retval Returned value can be one of the following values:
  * @arg LL_SYSCFG_REMAP_FLASH
  * @arg LL_SYSCFG_REMAP_SRAM
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetRemapMemory(void)
{
  uint32_t remap;
  uint32_t memory_map = LL_SYSCFG_REMAP_FLASH;

  remap = READ_BIT(FLASH->CONFIG, FLASH_CONFIG_REMAP) >> FLASH_CONFIG_REMAP_Pos;

  if (remap == 1)
  {
    memory_map = LL_SYSCFG_REMAP_SRAM;
  }
  else
  {
    memory_map = LL_SYSCFG_REMAP_FLASH;
  }
  return memory_map;
}

/**
  * @brief  Enable the I2C fast mode plus driving capability.
  * @rmtoll I2C_FMP_CTRL  I2C1_PAx_FMP/I2C2_PBx_FMP   LL_SYSCFG_EnableFastModePlus
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA0
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA1
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB7
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB10
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB11
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA7
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA13
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA14
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB7
  * @retval None
  * @note   LL_SYSCFG_I2C_FASTMODEPLUS_PB10, LL_SYSCFG_I2C_FASTMODEPLUS_PB11, LL_SYSCFG_I2C_FASTMODEPLUS_PA6,
  *         LL_SYSCFG_I2C_FASTMODEPLUS_PA7, LL_SYSCFG_I2C_FASTMODEPLUS_PA13 and LL_SYSCFG_I2C_FASTMODEPLUS_PA14
  */
__STATIC_INLINE void LL_SYSCFG_EnableFastModePlus(uint32_t ConfigFastModePlus)
{
  SET_BIT(SYSCFG->I2C_FMP_CTRL, ConfigFastModePlus);
}

/**
  * @brief  Disable the I2C fast mode plus driving capability.
  * @rmtoll I2C_FMP_CTRL  I2C1_PAx_FMP/I2C2_PBx_FMP   LL_SYSCFG_DisableFastModePlus
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA0
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA1
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB7
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB10
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB11
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA7
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA13
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA14
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB7
  * @retval None
  * @note   LL_SYSCFG_I2C_FASTMODEPLUS_PB10, LL_SYSCFG_I2C_FASTMODEPLUS_PB11, LL_SYSCFG_I2C_FASTMODEPLUS_PA6,
  *         LL_SYSCFG_I2C_FASTMODEPLUS_PA7, LL_SYSCFG_I2C_FASTMODEPLUS_PA13 and LL_SYSCFG_I2C_FASTMODEPLUS_PA14
  */
__STATIC_INLINE void LL_SYSCFG_DisableFastModePlus(uint32_t ConfigFastModePlus)
{
  CLEAR_BIT(SYSCFG->I2C_FMP_CTRL, ConfigFastModePlus);
}
/**
  * @}
  */

/** @defgroup SYSTEM_LL_PWRC SYSCFG Power Functions
  * @{
  */

/**
  * @brief  Enable PWRC Interrupt Mask
  * @rmtoll PWRC_IER        LL_SYSCFG_PWRC_EnableIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_PWRC_EnableIT(uint32_t Interrupt)
{
  SET_BIT(SYSCFG->PWRC_IER, Interrupt);
}

/**
  * @brief  Disable PWRC Interrupt Mask
  * @rmtoll PWRC_IER        LL_SYSCFG_PWRC_DisableIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_PWRC_DisableIT(uint32_t Interrupt)
{
  CLEAR_BIT(SYSCFG->PWRC_IER, Interrupt);
}

/**
  * @brief  Indicate if PWRC Interrupt Mask is enabled
  * @rmtoll PWRC_IER        LL_SYSCFG_PWRC_IsEnabledIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_PWRC_IsEnabledIT(uint32_t Interrupt)
{
  return ((READ_BIT(SYSCFG->PWRC_IER, Interrupt) == (Interrupt)) ? 1UL : 0UL);
}

/**
  * @brief  Get PWRC Interrupt Status
  * @rmtoll PWRC_ISCR        LL_SYSCFG_PWRC_GetStatusIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_PWRC_GetStatusIT(uint32_t Interrupt)
{
  return ((READ_BIT(SYSCFG->PWRC_ISCR, Interrupt) == (Interrupt)) ? 1UL : 0UL);
}

/**
  * @brief  Clear PWRC Interrupt Status
  * @rmtoll PWRC_ISCR        LL_SYSCFG_PWRC_ClearIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_PWRC_ClearIT(uint32_t Interrupt)
{
  SET_BIT(SYSCFG->PWRC_ISCR, Interrupt);
}

/**
  * @}
  */

/** @defgroup SYSCFG_IO_LL_Exported_Functions EXTI Exported Functions
  * @{
  */
/** @defgroup EXTI_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable IO Interrupt for Lines in range PA0... PB15
  * @rmtoll IO_IER        LL_EXTI_EnableIT
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WB06 and  STM32WB07
  * @note   PA0-PA3, PA8-PA11, PB0-PB7 and PB12-PB15 are valid for STM32WB05 and STM32WB09
  */
__STATIC_INLINE void LL_EXTI_EnableIT(uint32_t ExtiLine)
{
  SET_BIT(SYSCFG->IO_IER, ExtiLine);
}

/**
  * @brief  Disable IO Interrupt for Lines in range PA0... PB15
  * @rmtoll IO_IER        LL_EXTI_DisableIT
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WB06 and  STM32WB07
  * @note   PA0-PA3, PA8-PA11, PB0-PB7 and PB12-PB15 are valid for STM32WB05 and STM32WB09
  */
__STATIC_INLINE void LL_EXTI_DisableIT(uint32_t ExtiLine)
{
  CLEAR_BIT(SYSCFG->IO_IER, ExtiLine);
}

/**
  * @brief  Indicate if IO Interrupt Mask is enabled for Lines in range PA0... PB15
  * @rmtoll IO_IER        LL_EXTI_IsEnabledIT
  * @param  ExtiLine This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval State of bit (1 or 0).
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WB06 and  STM32WB07
  * @note   PA0-PA3, PA8-PA11, PB0-PB7 and PB12-PB15 are valid for STM32WB05 and STM32WB09
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledIT(uint32_t ExtiLine)
{
  return ((READ_BIT(SYSCFG->IO_IER, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_TYPE_Management Level/Edge Management
  * @{
  */

/**
  * @brief  Set IO Interrupt Type for Lines in range PA0... PB15
  * @rmtoll IO_DTR        LL_EXTI_EnableEdgeDetection
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WB06 and  STM32WB07
  * @note   PA0-PA3, PA8-PA11, PB0-PB7 and PB12-PB15 are valid for STM32WB05 and STM32WB09
  */
__STATIC_INLINE void LL_EXTI_EnableEdgeDetection(uint32_t ExtiLine)
{
  CLEAR_BIT(SYSCFG->IO_DTR, ExtiLine);
}

/**
  * @brief  Set IO Interrupt Type for Lines in range PA0... PB15
  * @rmtoll IO_DTR        LL_EXTI_DisableEdgeDetection
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WB06 and  STM32WB07
  * @note   PA0-PA3, PA8-PA11, PB0-PB7 and PB12-PB15 are valid for STM32WB05 and STM32WB09
  */
__STATIC_INLINE void LL_EXTI_DisableEdgeDetection(uint32_t ExtiLine)
{
  SET_BIT(SYSCFG->IO_DTR, ExtiLine);
}

/**
  * @brief  Get IO Interrupt Type for Lines in range PA0... PB15
  * @rmtoll IO_DTR        LL_EXTI_IsEnabledEdgeDetection
  * @param  ExtiLine This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
al One of the following values:
  *         @arg @ref LL_EXTI_TYPE_EDGE
  *         @arg @ref LL_EXTI_TYPE_LEVEL
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WB06 and  STM32WB07
  * @note   PA0-PA3, PA8-PA11, PB0-PB7 and PB12-PB15 are valid for STM32WB05 and STM32WB09
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledEdgeDetection(uint32_t ExtiLine)
{
  return ((READ_BIT(SYSCFG->IO_DTR, ExtiLine) == (ExtiLine)) ? 0UL : 1UL);
}
/**
  * @}
  */

