stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_system.h
/** @defgroup FLASH_Security FLASH Security Functions
  *  @brief Functions to read FLASH security applied
  * @{
  */

/**
  * @brief  Check if FLASH & RAM SWD access is disabled
  * @rmtoll SIZE           SWD_DISABLE  LL_FLASH_SWD_Access_IsDisabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_SWD_Access_IsDisabled(void)
{
  return ((READ_BIT(FLASH->SIZE, FLASH_FLASH_SIZE_SWD_DISABLE) == (FLASH_FLASH_SIZE_SWD_DISABLE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if FLASH Readout Protection is enabled
  * @rmtoll SIZE           FLASH_SECURE  LL_FLASH_ReadoutProtection_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_ReadoutProtection_IsEnabled(void)
{
  return ((READ_BIT(FLASH->SIZE, FLASH_FLASH_SIZE_FLASH_SECURE) == (FLASH_FLASH_SIZE_FLASH_SECURE)) ? 1UL : 0UL);
}

/**
  * @}
  */


/** @defgroup SYSTEM_LL_EF_FLASH FLASH
  * @{
  */

/**
  * @brief  Set FLASH Latency
  * @rmtoll FLASH_CONFIG    WAIT_STATE      LL_FLASH_SetLatency
  * @param  Latency This parameter can be one of the following values:
  * @arg LL_FLASH_LATENCY_0
  * @arg LL_FLASH_LATENCY_1
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetLatency(uint32_t Latency)
{
  MODIFY_REG(FLASH->CONFIG, FLASH_CONFIG_WAIT_STATES, Latency);
}

/**
  * @brief  Get FLASH Latency
  * @rmtoll FLASH_CONFIG    WAIT_STATE     LL_FLASH_GetLatency
  * @retval Returned value can be one of the following values:
  * @arg LL_FLASH_LATENCY_0
  * @arg LL_FLASH_LATENCY_1
  */
__STATIC_INLINE uint32_t LL_FLASH_GetLatency(void)
{
  return (uint32_t)(READ_BIT(FLASH->CONFIG, FLASH_CONFIG_WAIT_STATES));
}

/**
  * @}
  */
/**
  * @}
  */

/** @defgroup SYSCFG_BLE_LL_Exported_Functions SYSCFG BLE Exported Functions
  * @{
  */
/** @defgroup SYSCFG_LL_RADIO_RXTX_IT_Management RX TX IT_Management
  * @{
  */
/**
  * @brief  Enable Tx Rx Interrupt
  * @rmtoll BLERXTX_IER        LL_SYSCFG_BLERXTX_EnableIT
  * @param  Signal This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_BLE_TX_EVENT
  * @arg LL_SYSCFG_BLE_RX_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_BLERXTX_EnableIT(uint32_t Signal)
{
  SET_BIT(SYSCFG->BLERXTX_IER, Signal);
}

/**
  * @brief  Disable Tx Rx Interrupt
  * @rmtoll BLERXTX_IER        LL_SYSCFG_BLERXTX_DisableIT
  * @param  Signal This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_BLE_TX_EVENT
  * @arg LL_SYSCFG_BLE_RX_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_BLERXTX_DisableIT(uint32_t Signal)
{
  CLEAR_BIT(SYSCFG->BLERXTX_IER, Signal);
}

/**
  * @brief  Indicate if Tx Rx Interrupt is enabled
  * @rmtoll BLERXTX_IER        LL_SYSCFG_BLERXTX_IsEnabledIT
  * @param  Signal This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_BLE_TX_EVENT
  * @arg LL_SYSCFG_BLE_RX_EVENT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_BLERXTX_IsEnabledIT(uint32_t Signal)
{
  return ((READ_BIT(SYSCFG->BLERXTX_IER, Signal) == (Signal)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup SYSCFG_LL_RADIO_EVENT_TYPE_Management Level-Edge Management
  * @{
  */
/**
  * @brief  Set Tx-Rx Interrupt Detection Type
  * @rmtoll BLERXTX_DTR        LL_SYSCFG_BLERXTX_SetType
  * @param  Type This parameter can be one of the following values:
  * @arg LL_SYSCFG_BLERXTX_DET_TYPE_EDGE
  * @arg LL_SYSCFG_BLERXTX_DET_TYPE_LEVEL
  * @param  Signal This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_BLE_TX_EVENT
  * @arg LL_SYSCFG_BLE_RX_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_BLERXTX_SetType(uint8_t Type, uint32_t Signal)
{
  if (Type == LL_SYSCFG_BLERXTX_DET_TYPE_EDGE)
  {
    CLEAR_BIT(SYSCFG->BLERXTX_DTR, Signal);
  }
  else
  {
    SET_BIT(SYSCFG->BLERXTX_DTR, Signal);
  }
}

/**
  * @brief  Get Tx-Rx Interrupt Detection Type
  * @rmtoll BLERXTX_DTR        LL_SYSCFG_BLERXTX_GetType
  * @param  Signal This parameter one of the following values:
  * @arg LL_SYSCFG_BLE_TX_EVENT
  * @arg LL_SYSCFG_BLE_RX_EVENT
  * @retval One of the following values:
  * @arg LL_SYSCFG_BLERXTX_DET_TYPE_EDGE
  * @arg LL_SYSCFG_BLERXTX_DET_TYPE_LEVEL
  */
__STATIC_INLINE uint32_t LL_SYSCFG_BLERXTX_GetType(uint32_t Signal)
{
  if (READ_BIT(SYSCFG->BLERXTX_DTR, Signal))
  {
    return LL_SYSCFG_BLERXTX_DET_TYPE_LEVEL;
  }

  return LL_SYSCFG_BLERXTX_DET_TYPE_EDGE;
}

/**
  * @}
  */

/** @defgroup LL_SYSCFG_BLERXTX_Trigger Trigger Management
  * @{
  */
/**
  * @brief  Set Tx Rx Interrupt Trigger
  * @rmtoll BLERXTX_IBER/BLERXTX__IEVR/BLERXTX__DTR        LL_SYSCFG_BLERXTX_SetTrigger
  * @param  Trigger This parameter can be one of the following values:
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_RISING_EDGE
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_FALLING_EDGE
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_BOTH_EDGE
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_LOW_LEVEL
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_HIGH_LEVEL
  * @param  Signal This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_BLE_TX_EVENT
  * @arg LL_SYSCFG_BLE_RX_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_BLERXTX_SetTrigger(uint8_t Trigger, uint32_t Signal)
{
  switch (Trigger)
  {
    case LL_SYSCFG_BLERXTX_TRIGGER_BOTH_EDGE:
    {
      SET_BIT(SYSCFG->BLERXTX_IBER, Signal);
      CLEAR_BIT(SYSCFG->BLERXTX_IEVR, Signal);
      break;
    }
    case LL_SYSCFG_BLERXTX_TRIGGER_RISING_EDGE:
    {
      CLEAR_BIT(SYSCFG->BLERXTX_IBER, Signal);
      SET_BIT(SYSCFG->BLERXTX_IEVR, Signal);
      break;
    }
    case LL_SYSCFG_BLERXTX_TRIGGER_FALLING_EDGE:
    {
      CLEAR_BIT(SYSCFG->BLERXTX_IBER, Signal);
      CLEAR_BIT(SYSCFG->BLERXTX_IEVR, Signal);
      break;
    }
    case LL_SYSCFG_BLERXTX_TRIGGER_LOW_LEVEL:
    {
      CLEAR_BIT(SYSCFG->BLERXTX_IBER, Signal);
      CLEAR_BIT(SYSCFG->BLERXTX_IEVR, Signal);
      break;
    }
    case LL_SYSCFG_BLERXTX_TRIGGER_HIGH_LEVEL:
    {
      CLEAR_BIT(SYSCFG->BLERXTX_IBER, Signal);
      SET_BIT(SYSCFG->BLERXTX_IEVR, Signal);
    }
  }
}

/**
  * @brief  Get Tx Rx Interrupt Trigger
  * @rmtoll BLERXTX_IBER/BLERXTX_IEVR/BLERXTX_DTR        LL_SYSCFG_BLERXTX_GetTrigger
  * @param  Signal This parameter can be one of the following values:
  * @arg LL_SYSCFG_BLE_TX_EVENT
  * @arg LL_SYSCFG_BLE_RX_EVENT
  * @retval The return value can be one of the following values:
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_RISING_EDGE
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_FALLING_EDGE
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_BOTH_EDGE
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_LOW_LEVEL
  * @arg LL_SYSCFG_BLERXTX_TRIGGER_HIGH_LEVEL
  */
__STATIC_INLINE uint8_t LL_SYSCFG_BLERXTX_GetTrigger(uint32_t Signal)
{
  uint32_t level_setup, level_edge, both_edge;

