stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_system.h
  level_setup = READ_BIT(SYSCFG->BLERXTX_DTR, Signal);
  level_edge = READ_BIT(SYSCFG->BLERXTX_IEVR, Signal);
  both_edge = READ_BIT(SYSCFG->BLERXTX_IBER, Signal);

  if (level_setup)
  {
    if (level_edge)
    {
      return LL_SYSCFG_BLERXTX_TRIGGER_HIGH_LEVEL;
    }
    else
    {
      return LL_SYSCFG_BLERXTX_TRIGGER_LOW_LEVEL;
    }
  }
  else
  {
    if (both_edge)
    {
      return LL_SYSCFG_BLERXTX_TRIGGER_BOTH_EDGE;
    }
    if (level_edge)
    {
      return LL_SYSCFG_BLERXTX_TRIGGER_RISING_EDGE;
    }
  }
  return LL_SYSCFG_BLERXTX_TRIGGER_FALLING_EDGE;
}

/**
  * @}
  */

/** @defgroup SYSCFG_LL_EVENT_Flag_Management Flag Management
  * @{
  */
/**
  * @brief Check if the Tx Rx Interrupt is set or not
  * @note  This bit is cleared by writing a 1 to the bit.
  * @rmtoll BLERXTX_ISCR                   LL_SYSCFG_BLERXTX_IsInterruptPending
  * @param  Signal This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_BLE_TX_EVENT
  * @arg LL_SYSCFG_BLE_RX_EVENT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_BLERXTX_IsInterruptPending(uint32_t Signal)
{
  return ((READ_BIT(SYSCFG->BLERXTX_ISCR, Signal) == (Signal)) ? 1UL : 0UL);
}


/**
  * @brief Clear the Tx Rx Interrupt
  * @rmtoll BLERXTX_ISCR                   LL_SYSCFG_BLERXTX_ClearInterrupt
  * @param  Signal This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_BLE_TX_EVENT
  * @arg LL_SYSCFG_BLE_RX_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_BLERXTX_ClearInterrupt(uint32_t Signal)
{
  WRITE_REG(SYSCFG->BLERXTX_ISCR, Signal);
}


#if defined(SYSCFG_BLERXTX_ISCR_TX_ISEDGE)
/**
  * @brief Returns the TX interrupt edge status on a TX sequence event
  * @rmtoll BLERXTX_ISCR                   LL_SYSCFG_BLETX_EdgeSequence
  * @retval  The return value can be one of the following values:
  * @arg LL_SYSCFG_BLE_TX_FALLING_EDGE_EVENT
  * @arg LL_SYSCFG_BLE_TX_RISING_EDGE_EVENT
  */
__STATIC_INLINE uint32_t LL_SYSCFG_BLETX_EdgeSequence(void)
{
  return READ_BIT(SYSCFG->BLERXTX_ISCR, SYSCFG_BLERXTX_ISCR_TX_ISEDGE);
}
#endif


#if defined(SYSCFG_BLERXTX_ISCR_RX_ISEDGE)
/**
  * @brief Returns the RX interrupt edge status on a RX sequence event
  * @rmtoll BLERXTX_ISCR                   LL_SYSCFG_BLERX_EdgeSequence
  * @retval  The return value can be one of the following values:
  * @arg LL_SYSCFG_BLE_RX_FALLING_EDGE_EVENT
  * @arg LL_SYSCFG_BLE_RX_RISING_EDGE_EVENT
  */
__STATIC_INLINE uint32_t LL_SYSCFG_BLERX_EdgeSequence(void)
{
  return READ_BIT(SYSCFG->BLERXTX_ISCR, SYSCFG_BLERXTX_ISCR_RX_ISEDGE);
}
#endif


/**
  * @}
  */
/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup SYSCFG_IO_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus LL_SYSCFG_IO_Init(LL_SYSCFG_IO_InitTypeDef *SYSCFG_IO_InitStruct);
ErrorStatus LL_SYSCFG_IO_DeInit(void);
void LL_SYSCFG_IO_StructInit(LL_SYSCFG_IO_InitTypeDef *SYSCFG_IO_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */


/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (FLASH) || defined (SYSCFG) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WB0x_LL_SYSTEM_H */
